# OAuth1 OAuth2 차이점
## 실제 개념
OAuth1, OAuth2는 모두 인증/인가를 위한 프로토콜입니다. 
OAuth는 사용자가 자신의 계정 정보를 앱이나 서비스에 직접 제공하지 않고도, 그 서비스가 안전하게 사용자 정보를 사용할 수 있도록 허용하는 방법입니다.
예를 들어, 어떤 앱이 사용자의 구글 계정을 이용하려 할 때, 사용자가 비밀번호를 알려주지 않아도 인증이 가능하도록 하는 방식입니다.
### OAuth1
* 과거에 주로 사용되던 방식입니다.
* 앱이 구글 등 인증 서버에 계정 사용 권한을 요청을 하면, 과 서버가 모두 요청에 서명을 생성하여 서로 검증합니다.
* 이 서명(Signature) 과정이 복잡하며, 매 요청마다 앱과 서버가 서명을 정확히 맞춰야 하므로 구현이 어렵습니다.
* 서명을 통한 보안이 핵심이지만, 개발과 유지보수가 번거롭고 복잡한 단점이 있습니다.

## OAuth2
* 현재 대부분의 서비스에서 사용중인 최신 방식입니다.
* 앱이 인증 서버에 계정 사용 권한을 요청하면, 인증 서버가 ‘토큰(Token)’을 발급합니다.
* 앱은 이 토큰만 가지고도 인증 서버에 안전하게 접근할 수 있습니다. 별도의 서명 과정이 필요 없고, 대신 HTTPS 통신을 통해 보안을 유지합니다.
* 다양한 클라이언트 환경(웹, 모바일, 데스크톱 등)을 지원하며, 여러 인증 흐름(Grant Type)을 통해 유연하게 적용할 수 있습니다.
* 구현이 간단하고, 보안성도 높아 실무에서 널리 쓰입니다.
